---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetStringerGeometries
source: html/97e977c0-5be3-653b-2890-0602e9232f62.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetStringerGeometries Method

Gets the geometries of stringers.

## Syntax (C#)
```csharp
public IList<GeometryObject> GetStringerGeometries()
```

## Returns
The geometries of stringers.